Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: We have a lot of documentation. Be sure to check our <a href="{{site.baseurl}}/get-started/">Getting started page</a>, and all our <a href="{{site.baseurl}}/guides/">guides</a>. Also check out our <a href="{{site.baseurl}}/faq/">FAQ section</a> and <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">Quarkus Tips Playlist</a>
zh_cn: 我们有大量的文档。请务必查看我们的<a href="{{site.baseurl}}/get-started/">入门页面</a>，以及我们所有的<a href="{{site.baseurl}}/guides/">指南</a>。还可以查看我们的<a href="{{site.baseurl}}/faq/">FAQ部分</a>和<a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO">Quarkus Tips 播放列表</a>

source: We have not provided any JWT in our request, so we would not expect that there is any security state seen by the endpoint, and the response is consistent with that:
zh_cn: 我们在请求中没有提供任何JWT，所以我们不会期望有任何安全状态被终端看到，而响应也与此一致：

source: We need a consumer listening on the `greeting` address. This consumer can be in the same class or another bean such as:
zh_cn: 我们需要一个消费者监听 `greeting` 地址。这个消费者可以在同一个类中，也可以是另一个Bean，比如：

source: We need to write the entity into the database in a transaction.
zh_cn: 我们需要在一个事务中把实体写进数据库。

source: We open the file using the `open` method. It returns a `Uni<AsyncFile>`
zh_cn: 我们使用 `open` 方法打开该文件。它返回一个 `Uni<AsyncFile>` 类型的对象

source: We pre-boot as many of the frameworks as possible during the native compilation of a Quarkus application. It means that the resulting native executable has already run most of the startup code and serialized the result into the executable: even faster startup!
zh_cn: 在Quarkus应用程序的原生编译过程中，我们尽可能多地对框架进行预启动。这意味着产生的原生可执行文件已经运行了大部分的启动代码，并将结果序列化到可执行文件中：启动速度更快！

source: We recommend continuing the journey with the xref:deploying-to-kubernetes.adoc[deployment to Kubernetes and OpenShift].
zh_cn: 我们建议继续阅读 xref:deploying-to-kubernetes.adoc[部署到Kubernetes和OpenShift]。

source: We recommend that you follow the instructions from <<bootstrapping-the-project,Bootstrapping project>> and onwards to create the application step by step.
zh_cn: 我们建议你按照从 link:#bootstrapping-the-project[构建项目] 开始的指示，一步一步地创建应用程序。

source: We recommend that you follow the instructions in the following sections and create the application step by step. However, you can go right to the completed example.
zh_cn: 我们建议你按照下一节的说明逐步创建应用程序。然而，你也可以直接转到已完成的示例。

source: We recommend that you follow the instructions in the next sections and create applications step by step. However, you can go right to the completed example.
zh_cn: 我们建议你按照下面章节中的说明，一步一步地创建应用程序。但是，你可以直接转到已完成的示例。

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can go right to the completed example.
zh_cn: 我们建议您按照下一节的说明逐步创建应用程序。然而，您可以直接转到已完成的示例。

source: We recommend that you follow the instructions in the next sections and create the application step by step.
zh_cn: 我们建议你按照下面几节的说明逐步创建应用程序。

source: We recommend that you follow the instructions in the next sections and create the application step by step. However, you can skip right to the completed example.
zh_cn: 我们建议您按照下面几节的说明，一步一步地创建应用程序。不过，您可以直接跳到已完成的例子。

source: We recommend that you follow the instructions in the next sections and create the application step by step. You can skip right to the solution if you prefer. Either:
zh_cn: 我们建议您按照下面几节的说明，一步一步地创建应用程序。您也可以直接跳到解决方案。或者：

source: We recommend that you follow the instructions in the next sections and package the application step by step. However, you can go right to the completed example.
zh_cn: 我们建议您按照下面几节的说明，一步一步地打包应用。不过您还可以直接进入完成的例子。

source: We recommend using the Mutiny variant as it integrates with the other reactive APIs provided by Quarkus.
zh_cn: 我们推荐使用Mutiny变体，因为它可以与Quarkus提供的其他响应式API集成。

source: We see that the value of the `first` key is now `37` which is exactly the result of `10 + 27`, quick maths.
zh_cn: 我们看到，现在 `first` 键的值是 `37` ，这正是 `10 + 27` 的结果。

source: We use `installMockForInstance` to replace the injected bean, this takes effect for the duration of the test method.
zh_cn: 我们使用 `installMockForInstance` 以取代注入的bean，它在整个测试方法的持续时间内生效。

source: We use a profile because, you will see very soon, packaging the native executable takes a _few_ minutes. You could just pass -Dquarkus.package.type=native as a property on the command line, however it is better to use a profile as this allows native image tests to also be run.
zh_cn: 我们使用profile是因为，你很快就会看到，打包原生可执行文件需要 _few_ 分钟。你可以在命令行中把 -Dquarkus.package.type=native 作为一个属性，但是最好是使用一个profile，因为这可以使原生镜像测试也被运行。

source: We use constructor injection to receive the managed Vert.x instance. Field injection works too.
zh_cn: 我们使用构造函数注入的方式来接收被管理的Vert.x实例。当然 字段注入也被允许。

source: We use public fields here, but you can use private fields and getters/setters if you prefer.
zh_cn: 在这里我们使用public的字段，你也可以使用private字段和对应的getter/setter方法。

source: We use the Vert.x file system API to read the created file
zh_cn: 我们使用Vert.x文件系统API来读取创建的文件

source: We will create a simple test to ensure that this is being served correctly:
zh_cn: 我们将创建一个简单的测试以确保这个文件被正确的加载：

source: We will use a `smallrye.jwt.sign.key.location` property to point to this private signing key.
zh_cn: 我们将使用一个 `smallrye.jwt.sign.key.location` 属性来指向这个私人签名钥匙。

source: We'll be using the Quarkus Redis Client extension to connect to our Redis Server. The extension is implemented on top of the https://vertx.io/docs/vertx-redis-client/java/[Vert.x Redis Client], providing an asynchronous and non-blocking way to connect to Redis.
zh_cn: 我们将使用Quarkus Redis客户端扩展来连接到Redis服务。该扩展是在 link:https://vertx.io/docs/vertx-redis-client/java/[Vert.x Redis客户端] 的基础上实现的，提供了一种异步和非阻塞的方式来连接Redis服务。

source: Web
zh_cn: 网络

source: Web Client
zh_cn: Web客户端

source: WebAuthn authentication
zh_cn: WebAuthn认证机制

source: Weekly Builds
zh_cn: 每周构建

source: What Makes Quarkus Different?
zh_cn: 是什么让Quarkus与众不同？

source: What are the extension statuses?
zh_cn: 什么是扩展状态?

source: What does having a working C developer environment mean?
zh_cn: 拥有一个C语言工作开发者环境意味着什么？

source: What does it mean to be a Kubernetes-native framework?
zh_cn: 作为一个Kubernetes原生框架意味着什么？

source: What is Quarkus?
zh_cn: Quarkus是什么？

source: What is a Quarkus extension?
zh_cn: 什么是Quarkus扩展?

source: What is your license?
zh_cn: 使用什么许可证？

source: What to do when there is no initial offset in Kafka.Accepted values are earliest, latest and none Type: _string_
zh_cn: 当Kafka没有初始偏移量时的处理策略。可接受的值是earliest, latest 和 none 类型: _string_

source: What we mean by "Supersonic Subatomic Java".
zh_cn: "超音速亚原子Java"是什么意思。

source: What we're doing in Panache is allow you to write your Hibernate Reactive entities like this:
zh_cn: Panache允许这样编写Hibernate Reactive实体：

source: What we're doing in Panache is to allow you to write your Hibernate ORM entities like this:
zh_cn: Panache允许这样编写Hibernate ORM实体：

source: What's next?
zh_cn: 下一步做什么？

source: When Kafka broker receives a record, its acknowledgement can take time depending on the configuration. Also, it stores in-memory the records that cannot be written.
zh_cn: 当Kafka broker收到一条记录时，它的确认可能需要时间，这取决于配置。此外，它还会在内存中存储不能写入的记录。

source: When Quarkus was designed, we didn’t focus only on containers but also on deploying Quarkus applications on container orchestrators such as Kubernetes. Quarkus build-time processing also generates the Kubernetes metadata, so your application is ready to be deployed on Kubernetes. Runtime capabilities such as health checks and metrics are exposed out of the box. Quarkus collects all the required metadata at build time to create the Kubernetes deployment descriptor and produce a container image. A single command line can deploy your application onto your Kubernetes cluster.
zh_cn: 在设计Quarkus时，我们不仅关注容器，还关注将Quarkus应用程序部署到容器协调器(如Kubernetes)上。Quarkus构建时处理还会生成Kubernetes元数据，这样就可以将应用程序部署到Kubernetes上了。运行时功能(如健康检查和指标)是开箱即用的。Quarkus在构建时收集所有必需的元数据，以创建Kubernetes部署描述符并生成容器镜像。一个命令行就可以将应用程序部署到Kubernetes集群上。

source: When `@QuarkusIntegrationTest` results in launching a container (because the application was built with `quarkus.container-image.build` set to `true`), the container is launched on a predictable container network. This facilitates writing integration tests that need to launch services to support the application. This means that `@QuarkusIntegrationTest` works out of the box with containers launched via xref:dev-services.adoc[Dev Services], but it also means that it enables using <<quarkus-test-resource,QuarkusTestLifecycleManager>> resources that launch additional containers. This can be achieved by having your `QuarkusTestLifecycleManager` implement `io.quarkus.test.common.DevServicesContext.ContextAware`. A simple example could be the following:
zh_cn: 当 `@QuarkusIntegrationTest` 启动一个容器时（因为应用程序在构建时将 `quarkus.container-image.build` 设置为 `true` ），该容器会在一个可预测的容器网络上启动。这有利于编写需要启动服务以支持应用程序的集成测试。这意味着 `@QuarkusIntegrationTest` 能够与通过 link:dev-services.html[Dev Services] 启动的容器一起开箱即用，但这也意味着它能够使用 link:#quarkus-test-resource[QuarkusTestLifecycleManager] 资源来启动额外的容器。这可以通过让您的 `QuarkusTestLifecycleManager` 实现 `io.quarkus.test.common.DevServicesContext.ContextAware` 来获得。一个简单的例子：

source: When `objcopy` is not available debug symbols are embedded in the executable.
zh_cn: 当被嵌入到可执行文件中的 `objcopy` 调试符号不可用时。

source: When `partitions` is greater than 1, this attribute allows configuring how many records are requested by each consumers every time. Type: _int_
zh_cn: 当 `partitions` 大于1时，这个属性配置每个消费者每次允许请求多少条记录。 类型: _int_

source: When a JSON extension is installed such as `quarkus-resteasy-reactive-jackson` or `quarkus-resteasy-reactive-jsonb`, Quarkus will use the `application/json` media type by default for most return values, unless the media type is explicitly set via `@Produces` or `@Consumes` annotations (there are some exceptions for well known types, such as `String` and `File`, which default to `text/plain` and `application/octet-stream` respectively).
zh_cn: 当安装了一个JSON扩展，如 `quarkus-resteasy-reactive-jackson` 或 `quarkus-resteasy-reactive-jsonb` ，Quarkus将对大多数返回值默认使用 `application/json` 媒体类型，除非通过 `@Produces` 或 `@Consumes` 注解明确设置媒体类型（对于众所周知的类型有一些例外，如 `String` 和 `File` ，它们分别默认为 `text/plain` 和 `application/octet-stream` ）。

source: When a Reactive Messaging Message associated with an AMQP Message is acknowledged, it informs the broker that the message has been http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[accepted].
zh_cn: 当与AMQP消息关联的响应式消息被确认时，它会通知代理该消息已被 link:http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-accepted[接受] 。

source: When a deserialization failure occurs, you can intercept it and provide a failure strategy. To achieve this, you need to create a bean implementing `DeserializationFailureHandler<T>` interface:
zh_cn: 当反序列化失败发生时，您可以对其进行拦截并提供一个失败处理策略。为了实现这一点，您需要创建一个实现 `DeserializationFailureHandler<T>` 接口的bean：

source: When a message produced from a Kafka record is acknowledged, the connector invokes a commit strategy. These strategies decide when the consumer offset for a specific topic/partition is committed. Committing an offset indicates that all previous records have been processed. It is also the position where the application would restart the processing after a crash recovery or a restart.
zh_cn: 当一条由Kafka记录产生的消息被确认时，connector将会调用一个提交策略。这些策略决定了特定topic/分区(topic/partition)的消费者偏移将在何时被提交。提交一个偏移量(offset)表明所有之前的记录已经被处理了。它也是应用程序从崩溃中恢复后或重启后重新开始处理的位置。

source: When adding `kotlin` to the extensions list, the Maven plugin will generate a project that is properly configured to work with Kotlin. Furthermore the `org.acme.ReactiveGreetingResource` class is implemented as Kotlin source code (as is the case with the generated tests). The addition of `resteasy-reactive-jackson` in the extension list results in importing the RESTEasy Reactive and Jackson extensions.
zh_cn: 将 `kotlin` 添加到扩展列表后，Maven插件将生成一个经过正确配置的项目，以便与Kotlin一起工作。此外， `org.acme.ReactiveGreetingResource` 类会通过kotlin代码来进行实现（与生成的测试一样）。在扩展列表中添加 `resteasy-reactive-jackson` ，就会导入RESTEasy Reactive和Jackson扩展。

source: When building a native executable, GraalVM operates with a closed world assumption. It analyzes the call tree and removes all the classes/methods/fields that are not used directly.
zh_cn: 在构建本地可执行文件时，GraalVM以封闭世界的假设进行操作。它分析调用树并删除所有不直接使用的类/方法/字段。

source: When consuming messages with `@Channel`, the application code is responsible for the subscription. In the example above, the RESTEasy Reactive endpoint handles that for you.
zh_cn: 当使用 `@Channel` 消费消息时，代码需要负责消息订阅。在上面的例子中，RESTEasy Reactive endpoint 已负责为您处理了这个问题。

source: When creating a custom `QuarkusTestResourceLifecycleManager` that needs to inject the something into the test class, the `inject` methods can be used. If for example you have a test like the following:
zh_cn: 当创建一个自定义的 `QuarkusTestResourceLifecycleManager` 来将某些资源注入到测试类时，可以使用 `inject` 方法。例如，如果您有一个像下面这样的测试：

source: When executing an HTTP GET request against `http://localhost:8080/hello`, you see a JSON message with the value `hello` as its `message` field.
zh_cn: 当执行一个对 `http://localhost:8080/hello` 的HTTP GET请求时，您会看到一个JSON消息，其 `message` 字段的值是 `hello` 。

source: When it comes to writing Hibernate ORM entities, there are a number of annoying things that users have grown used to reluctantly deal with, such as:
zh_cn: 在编写Hibernate ORM实体类时，用户已经习惯了被迫处理许多烦人的事情，例如：

source: When it comes to writing Hibernate Reactive entities, there are a number of annoying things that users have grown used to reluctantly deal with, such as:
zh_cn: 在编写Hibernate Reactive实体类时，用户已经习惯了被迫处理许多烦人的事情，例如：

source: When it comes to writing MongoDB entities, there are a number of annoying things that users have grown used to reluctantly deal with, such as:
zh_cn: 在编写MongoDB实体时，用户已经习惯了不情愿地处理许多烦人的事情，例如：

source: When multiple classes or packages need to be specified via the `quarkus.native.additional-build-args` configuration property, the `,` symbol needs to be escaped. An example of this is the following:
zh_cn: 当需要通过 `quarkus.native.additional-build-args` 配置属性指定多个类或包时，需要对 `,` 符号进行转义。这方面的一个例子如下。

source: When no deserialization failure handler is set and a deserialization failure happens, report the failure and mark the application as unhealthy. If set to `false` and a deserialization failure happens, a `null` value is forwarded. Type: _boolean_
zh_cn: 当没有设置反序列化失败处理程序而反序列化失败发生时，报告该失败并将应用程序标记为不健康。如果设置为 `false` 并且发生了反序列化失败，会发送一个 `null` 。 类型: _boolean_

source: When not running in dev or test mode, you will need to start your AMQP broker. You can follow the instructions from the https://activemq.apache.org/components/artemis/documentation/latest/using-server.html[Apache ActiveMQ Artemis website] or create a `docker-compose.yaml` file with the following content:
zh_cn: 当不在开发或测试模式下运行时，你需要启动你的AMQP代理。你可以按照 link:https://activemq.apache.org/components/artemis/documentation/latest/using-server.html[Apache ActiveMQ Artemis网站]中的说明，或者使用以下内容创建一个 `docker-compose.yaml` 文件：

source: When processing a request requires interacting with a remote service, like an HTTP API or a database, it does not block the execution while waiting for the response. Instead, it schedules the I/O operation and attaches a continuation, i.e., the request processing remaining code. This continuation can be passed as a callback (a function invoked with the I/O outcome), or use more advanced constructs such as reactive programming or co-routines. Regardless of how the continuation is expressed, the essential aspect is the release of the I/O thread and, as a consequence, the fact that this thread can be used to process another request. When the scheduled I/O completes, the I/O thread executes the continuation, and the processing of the pending request continues.
zh_cn: 当处理请求需要与远程服务(如HTTP API或数据库)交互时，它不会在等待响应时阻塞执行。相反，它调度I/O操作并附加一个延续，即请求处理剩余的代码。这种延续可以作为回调传递 (与I/O结果一起调用的函数)，或者使用更高级的结构，诸如响应式编程或协同程序。不管延续是如何表示的，最基本的方面是释放I/O线程，因此，这个线程可以用来处理另一个请求。当计划的I/O完成时，I/O线程执行延续，并继续处理挂起的请求。

source: When processing messages, you can propagate incoming record key to the outgoing record.
zh_cn: 在处理信息时，您可以将传入的记录键发送给传出的记录。

source: When running in appropriately configured Kubernetes clusters, Kafka extension will pull its Kafka broker connection configuration from the service binding available inside the cluster, without the need for user configuration.
zh_cn: 当在正确配置的Kubernetes集群中运行时，Kafka扩展将从集群内部可用的服务绑定中获取Kafka broker连接配置，而不需要用户来配置。

source: When running tests this way, the only things that actually run natively are you application endpoints, which you can only test via HTTP calls. Your test code does not actually run natively, so if you are testing code that does not call your HTTP endpoints, it's probably not a good idea to run them as part of native tests.
zh_cn: 当以这种方式运行测试时，唯一真正在本地运行的是你的应用程序端点，你只能通过HTTP调用来测试。你的测试代码实际上并不在本地运行，所以如果你测试的代码不调用你的HTTP端点，把它们作为本地测试的一部分运行可能不是一个好主意。

source: When running the production version of the application, the MongoDB connection need to be configured as normal, so if you want to include a production database config in your `application.properties` and continue to use Dev Services we recommend that you use the `%prod.` profile to define your MongoDB settings.
zh_cn: 当运行应用程序的生产版本时，MongoDB连接需要正常配置，如果您希望在 `application.properties` 中包含生产数据库配置并继续使用开发服务，我们建议你使用 `%prod.` 配置文件来定义你的MongoDB设置。

source: When running the production version of the application, the Redis connection need to be configured as normal, so if you want to include a production database config in your `application.properties` and continue to use Dev Services we recommend that you use the `%prod.` profile to define your Redis settings.
zh_cn: 运行应用程序的生产版本需要正常配置Redis连接，所以如果你想在 `application.properties` 中定义生产的数据库配置，同时继续使用Dev Services，我们建议你使用 `%prod.` profile来定义你的Redis设置。

source: When sending `Messages`, you can add an instance of `OutgoingAmqpMetadata` to influence how the message is going to be sent to AMQP. For example, you can configure the subjects, properties:
zh_cn: 当发送 `Messages` 时，你可以添加一个 `OutgoingAmqpMetadata` 的实例来影响消息是如何被发送到AMQP的。例如，你可以配置主题、属性。

source: When sending a `Message<T>`, the connector converts the message into an AMQP Message. The payload is converted to the AMQP Message _body_.
zh_cn: 当发送一个 `Message<T>` 时，连接器将消息转换为AMQP消息。有效载荷被转换为AMQP消息 _body_ 。

source: When should you use a Gauge? Only if you can't use something else. Never gauge something you can count. Gauges can be less straight-forward to use than counters. If what you are measuring can be counted (because the value always increments), use a counter instead.
zh_cn: 什么时候应该使用Gauge？只有在您无法使用其他测量值的时候。不要对您可以计算的东西使用gauge。Gauges的使用可能没有counters那么直白。如果您要测量的东西可以计数（因为数值总是递增的），就用counter代替。

source: When should you use a counter? Only if you are doing something that can not be either timed (or summarized). Counters only record a count, which may be all that is needed. However, if you want to understand more about how a value is changing, a timer (when the base unit of measurement is time) or a distribution summary might be more appropriate.
zh_cn: 那么什么时候使用counter呢？只有当您正在做的事情不能被计时(timed）（或总结summarized）的时候。counter只记录一个计数值，而这个值可能就是所需的全部。但是，如果您想更多地了解一个值是如何变化的，那么timer（当基本的测量单位是时间时）或distribution summary可能更合适。

source: When testing Quarkus security, ensure that your `IdentityProvider` is already set with usernames, passwords, and roles in `application.properties`. For more information about testing Quarkus Security, see xref:security-testing.adoc#configuring-user-information[Configuring user information].
zh_cn: 当测试Quarkus Security的时候，请确保您已经在 `application.properties` 设置了 `IdentityProvider` 以及对应的用户名、密码以及角色。请参见 link:security-testing.html#configuring-user-information[设置用户信息] 以了解更多关于测试Quarkus Security的信息。

source: When the Kafka producer receives an error from the server, if it is a transient, recoverable error, the client will retry sending the batch of messages. This behavior is controlled by `retries` and `retry.backoff.ms` parameters. In addition to this, SmallRye Reactive Messaging will retry individual messages on recoverable errors, depending on the `retries` and `delivery.timeout.ms` parameters.
zh_cn: 当Kafka生产者收到来自服务器的错误时，如果它是一个暂时的、可恢复的错误，那么客户端将重试发送这批消息。这种行为是由 `retries` 和 `retry.backoff.ms` 参数控制的。除此之外，SmallRye Reactive Messaging还会在可恢复的错误中重试单个消息，这取决于 `retries` 和 `delivery.timeout.ms` 参数。

source: When the `failure-strategy` is set to `dead-letter-queue` indicates on which topic the record is sent. Defaults is `dead-letter-topic-$channel` Type: _string_
zh_cn: 当 `failure-strategy` 被设置为 `dead-letter-queue` ，用来指明记录会发送到哪个主题的。默认值是 `dead-letter-topic-$channel` 类型: _string_

source: When the `failure-strategy` is set to `dead-letter-queue` indicates the key serializer to use. If not set the serializer associated to the key deserializer is used Type: _string_
zh_cn: 当 `failure-strategy` 被设置为 `dead-letter-queue` 时，表示要使用的键值的序列化器。如果没有设置则使用与键值反序列化器相关的序列化器 Type: _string_

source: When the `failure-strategy` is set to `dead-letter-queue` indicates the value serializer to use. If not set the serializer associated to the value deserializer is used Type: _string_
zh_cn: 当 `failure-strategy` 被设置为 `dead-letter-queue` ，表示要使用的值的序列化器。如果没有设置，则使用与值反序列化器相关的序列化器n 类型: _string_

source: When the file is opened, we retrieve a `Multi` which will contain the chunks.
zh_cn: 当文件被打开时，我们获得到一个 `Multi` ，它包含了块的内容。

source: When the test stops, clear the `InMemoryConnector` (discard all the received and sent messages)
zh_cn: 当测试停止时，清除 `InMemoryConnector` (丢弃所有接收和发送的信息)。

source: When topics/partitions are assigned or revoked from a consumer, it pauses the message delivery and resumes once the rebalance completes.
zh_cn: 当topic/分区被从消费者那里分配或撤销时，它会暂停消息传递， 然后在重平衡完成后立即恢复。

source: When using Flyway together with Hibernate ORM, you can use the Dev UI to generate the initial schema creation script.
zh_cn: 当Flyway与Hibernate ORM一起使用时，你可以使用Dev UI来生成初始表创建脚本。

source: When using Kotlin data classes with `native-image` you may experience serialization errors that do not occur with the `JVM` version, despite the Kotlin Jackson Module being registered. This is especially so if you have a more complex JSON hierarchy, where an issue on a lower node causes a serialization failure. The error message displayed is a catch-all and typically displays an issue with the root object, which may not necessarily be the case.
zh_cn: 当使用Kotlin数据类与 `native-image` 时，尽管Kotlin Jackson模块已被注册，但您可能会遇到JVM版本中不会出现的序列化错误。特别是如果您有一个更复杂的JSON层次结构，低层节点上的问题导致序列化失败。显示的错误消息是一条全面的错误消息，其通常会显示根对象引发了这个问题，但情况可能并非如此。

source: When using Kubernetes, it is recommended to set the client id and secret in a Kubernetes secret:
zh_cn: 当使用Kubernetes时，建议在Kubernetes secret中设置客户端ID和secret：

source: When using Maven, we could use the following configuration:
zh_cn: 使用Maven时，我们可以使用以下配置：

source: When using Panache, things are simple:
zh_cn: 使用Panache时，事情很简单：

source: When using Quarkus Dev Mode just invoke HTTP requests on `http://localhost:8080` as you normally would when testing your REST endpoints. This request will hit the Mock Event Server and will be converted to the API Gateway json message that is consumed by the Quarkus Lambda Poll loop.
zh_cn: 当使用Quarkus开发模式时，只需对 `http://localhost:8080` 调用HTTP请求，就像通常测试REST端点时所做的那样。这个请求将访问模拟事件服务器，并将被转换为API Gateway json消息，被Quarkus Lambda Poll循环所消费。

source: When using REST Assured in your test, the connection and response timeouts are set to 30 seconds. You can override this setting with the `quarkus.http.test-timeout` property:
zh_cn: 当在您的测试中使用REST Assured时，连接和响应超时默认设置为30秒。可以通过 `quarkus.http.test-timeout` 属性覆盖该设置：

source: When using Reactive Messaging and the Kafka connector, each configured channel (incoming or outgoing) provides _startup_, _liveness_ and _readiness_ checks.
zh_cn: 当使用响应式消息传递和Kafka 连接器时，每个配置的 channel (传入或传出)都会提供 _启动_ 、 _活跃度(liveness)_ 和 _就绪_ 检查。
